tap "anomalyco/tap"
tap "deskflow/tap"
tap "felixkratz/formulae"
tap "gromgit/fuse"
tap "laishulu/homebrew"
tap "lihaoyun6/tap"
tap "lizardbyte/homebrew"
tap "nikitabobko/tap"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# DuckDuckGo from the terminal
brew "ddgr"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream many audio and video codecs
brew "ffmpeg-full"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Fast and simple Node.js version manager
brew "fnm"
# CLI program that accepts piped input and presents files for selection
brew "fpp"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Cinematic Git commit replay tool
brew "gitlogue"
# Open-source GitLab command-line tool
brew "glab"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Tools and libraries to manipulate images in many formats
brew "imagemagick-full", link: true
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Mac App Store command-line interface
brew "mas"
# Deep clean and optimize your Mac
brew "mole"
# Small build system for use with gyp or CMake
brew "ninja"
# Retrieves currently playing media, and simulates media actions
brew "nowplaying-cli"
# Animated pipes terminal screensaver
brew "pipes-sh"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# SVG rendering tool and library
brew "resvg"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Display and control your Android device
brew "scrcpy"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Cross-shell prompt for astronauts
brew "starship"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Alternative ssh client with additional features to meet your needs
brew "trzsz-ssh"
# Terminal UI OS (Terminal Multiplexer)
brew "tuios"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Read-write NTFS driver for FUSE
brew "gromgit/fuse/ntfs-3g-mac"
# Self-hosted game stream host for Moonlight
brew "lizardbyte/homebrew/sunshine"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Enable Windows-like alt-tab
cask "alt-tab"
# Android SDK component
cask "android-platform-tools"
# Tools for building Android applications
cask "android-studio"
# Allows connection to a computer remotely
cask "anydesk"
# Cloud storage service
cask "baidunetdisk"
# Open-source KVM software
cask "barrier"
# Display management tool
cask "betterdisplay"
# Compare files and folders
cask "beyond-compare"
# Virtual Audio Driver
cask "blackhole-2ch"
# Voice and text chat software
cask "discord"
# Write, edit, and chat about your code with AI
cask "cursor"
# 3D creation suite
cask "blender"
# Continuation of Clash Verge - A Clash Meta GUI based on Tauri
cask "clash-verge-rev"
# Mouse and keyboard sharing utility
cask "deskflow/tap/deskflow"
# Dictionary and translator app
cask "easydict"
# Collaborative team software
cask "figma"
# Per-application volume mixer, equalizer, and audio router
cask "finetune"
# Web browser
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspice-nerd-font"
cask "font-noto-sans-symbols-2"
cask "laishulu/homebrew/font-sarasa-nerd"
cask "font-symbols-only-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Web browser
cask "google-chrome"
# Desktop automation application
cask "hammerspoon"
# Open-source screen recorder built with web technology
cask "kap"
# Open-source keystroke visualiser
cask "keycastr"
# GPU-based terminal emulator
cask "kitty"
# Support for Logitech G gear
cask "logitech-g-hub"
# Trims video and audio files losslessly
cask "losslesscut"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Tool for multi-language users
cask "input-source-pro"
# Keyboard customiser
cask "karabiner-elements"
# Mouse utility to add gesture functions and smooth scrolling to 3rd party mice
cask "mac-mouse-fix"
# File system integration
cask "macfuse"
# Multi-platform web browser
cask "microsoft-edge"
# Re-mounts write-protected NTFS volumes
cask "mounty"
# Open-source software for live streaming and screen recording
cask "obs"
# Instant messaging tool
cask "qq"
# Control your tools with a few keystrokes
cask "raycast"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Snip or pin screenshots
cask "snipaste"
# Rime input method engine
cask "squirrel-app"
# System monitor for the menu bar
cask "stats"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Free messaging and calling application
cask "wechat"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# All-in-one office service platform in Chinese
cask "wpsoffice-cn"
# Multiplayer code editor
cask "zed"
mas "Xcode", id: 497799835
mas "腾讯会议", id: 1484048379
mas "飞书", id: 1551632588
vscode "catppuccin.catppuccin-vsc"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.remote-explorer"
vscode "obkoro1.korofileheader"
vscode "skacekachna.win-opacity"
vscode "vscode-icons-team.vscode-icons"
vscode "wangguixuan.var-translate-en"
vscode "yzhang.markdown-all-in-one"
